game-bot/src/Enums/РежимРаботыБота/РежимРаботыБота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимРаботыБота</name>
  <enumValues>
    <name>Эхо</name>
  </enumValues>
  <enumValues>
    <name>ПростаяВикторина</name>
  </enumValues>
  <enumValues>
    <name>ТестСРасшифровкой</name>
  </enumValues>
  <enumValues>
    <name>МойРежимГайд</name>
  </enumValues>
  <enumValues>
    <name>Бот</name>
  </enumValues>
</mdclass:Enum>

game-bot/src/CommonModules/ИнтеграцияТелеграмПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработчик для добавления алгоритмов обработки входящих сообщений
// 
// Параметры:
//  ЭлементОчередиОбъект - СправочникОбъект.ОчередьОбработкиСообщений - Элемент очереди объект
//  ДанныеЭлемента - Структура - Десериализованные данные элемента
Процедура ПриОбработкеЭлементаОчереди(ЭлементОчередиОбъект, ДанныеЭлемента) Экспорт
	
	
	РежимРаботы = Константы.РежимРаботыБота.Получить();
	
	Если РежимРаботы = Перечисления.РежимРаботыБота.Эхо Тогда
		ТелеграмЭхо.ПриОбработкеЭлементаОчереди(ДанныеЭлемента);
	ИначеЕсли РежимРаботы = Перечисления.РежимРаботыБота.ПростаяВикторина Тогда
		ТелеграмПростаяВикторина.ПриОбработкеЭлементаОчереди(ДанныеЭлемента);
	ИначеЕсли РежимРаботы = Перечисления.РежимРаботыБота.ТестСРасшифровкой Тогда
		ТелеграмТестСРасшифровкой.ПриОбработкеЭлементаОчереди(ДанныеЭлемента, ЭлементОчередиОбъект.Отправитель);
	ИначеЕсли РежимРаботы = Перечисления.РежимРаботыБота.МойРежимГайд Тогда 
		ТелеграмМойРежимГайд.ПриОбработкеЭлементаОчереди(ДанныеЭлемента);
	ИначеЕсли РежимРаботы = Перечисления.РежимРаботыБота.Бот Тогда
		ТелеграмБот.ПриОбработкеЭлементаОчереди(ДанныеЭлемента);
	Иначе
		ВызватьИсключение "Не указан режим работы бота";
	КонецЕсли;
	
КонецПроцедуры

Функция КлавиатураГлавноеМенюInline() Экспорт

	Ряд1 = Новый Массив;
	Ряд1.Добавить(Новый Структура("text,callback_data", "🏠 Меню", "menu"));
	Ряд1.Добавить(Новый Структура("text,callback_data", "🆘 Помощь", "help"));

	Ряд2 = Новый Массив;
	Ряд2.Добавить(Новый Структура("text,callback_data", "📞 Контакты", "contacts"));
	Ряд2.Добавить(Новый Структура("text,callback_data", "⚙ Настройки", "settings"));

	Строки = Новый Массив;
	Строки.Добавить(Ряд1);
	Строки.Добавить(Ряд2);

	Возврат Новый Структура("inline_keyboard", Строки);

КонецФункции



#КонецОбласти
